name: "densenet_onnx"
backend: "onnxruntime"
max_batch_size: 0
input [
  {
    name: "data_0"
    data_type: TYPE_FP32
    format: FORMAT_NCHW
    dims: [ 3, 224, 224 ]
    reshape { shape: [ 1, 3, 224, 224 ] }
  }
]
output [
  {
    name: "fc6_1"
    data_type: TYPE_FP32
    dims: [ 1000 ]
    reshape { shape: [ 1, 1000, 1, 1 ] }
    label_filename: "densenet_labels.txt"
  }
]
instance_group [
  {
    kind: KIND_GPU
  }
]
optimization {
  execution_accelerators {
    gpu_execution_accelerator: [
      {
        name: "tensorrt"
        parameters {
          key: "precision_mode"
          value: "FP16"
        }
        parameters { key: "max_workspace_size_bytes" value: "4294967296" }
        parameters { key: "trt_engine_cache_enable" value: "true" }
        parameters { key: "trt_engine_cache_path" value: "." }
      }
   
    ]
  }
}



model-analyzer profile \
-m /workspace/model_repository \
--profile-models densenet_onnx \
--triton-launch-mode=docker \
--triton-docker-mounts=/workspace/model_repository:/workspace/model_repository:rw \
--output-model-repository-path /workspace/output \
--export-path /workspace/profile_results \
--override-output-model-repository