name: "image_encoder"
backend: "onnxruntime"

dynamic_batching {}

input [
    {
        name: "input"
        data_type: TYPE_FP32
        dims: [-1, 3, 1024, 1024]
    }
]

output [
    {
        name: "output"
        data_type: TYPE_FP32
        dims: [-1, 256, 64, 64]
    }
]

instance_group [
    {
        count: 1
        kind: KIND_GPU
    }
]